Enterprise_Serivces/Cert/Bronze3/CSLNonceService/result1/Iteration1/t5_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/nonce/contracts/2010/05/INonceService/StoreNonce</wsa:Action><wsa:MessageID>uuid:d021eaa5-ca07-4e33-b930-27929438972d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslnonceserviceqa1.testgs.pvt/NonceService.svc</wsa:To></soap:Header><soap:Body><StoreNonce xmlns="http://www.gamestop.com/services/csl/nonce/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><Nonce xmlns="http://www.gamestop.com/services/csl/nonce/messages/2010/05"><Code xmlns="http://www.gamestop.com/services/csl/nonce/entities/2010/05">abcde</Code><Context xmlns="http://www.gamestop.com/services/csl/nonce/entities/2010/05">abcde</Context><Expires xmlns="http://www.gamestop.com/services/csl/nonce/entities/2010/05">2017-01-20T15:51:26</Expires><Issued xmlns="http://www.gamestop.com/services/csl/nonce/entities/2010/05">2017-01-20T15:51:26</Issued><NonceID xmlns="http://www.gamestop.com/services/csl/nonce/entities/2010/05">4435</NonceID></Nonce><NonceType xmlns="http://www.gamestop.com/services/csl/nonce/messages/2010/05">IsIssued</NonceType></request></StoreNonce></soap:Body></soap:Envelope>